app/controllers/fragrances_controller.rb

    def index
        @fragrances = Fragrance.all
---
SELECT "fragrances".* FROM "fragrances"

    def create
        @fragrance = Fragrance.new(fragrance_params)
        if @fragrance.save!
            Candle.find_or_create_by(fragrance: @fragrance)
---
INSERT INTO "fragrances" ("name", "description", "category", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "test"], ["description", "the"], ["category", "new"], ["image_url", "create"], ["created_at", "2024-07-29 17:29:08.884308"], ["updated_at", "2024-07-29 17:29:08.884308"]]
INSERT INTO "candles" ("fragrance_id", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["fragrance_id", 11], ["created_at", "2024-07-29 17:29:09.051662"], ["updated_at", "2024-07-29 17:29:09.051662"]]
INSERT INTO "fragrances" ("name", "description", "category", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "test"], ["description", "the"], ["category", "new"], ["image_url", "create"], ["created_at", "2024-07-29 17:29:09.047153"], ["updated_at", "2024-07-29 17:29:09.047153"]]
SELECT "candles".* FROM "candles" WHERE "candles"."fragrance_id" = ? LIMIT ?  [["fragrance_id", 16], ["LIMIT", 1]]

    def edit
        @fragrance = Fragrance.find(params[:id])
---
SELECT "fragrances".* FROM "fragrances" WHERE "fragrances"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        @fragrance = Fragrance.find(params[:id])
        if @fragrance.update(fragrance_params)
---
SELECT "fragrances".* FROM "fragrances" WHERE "fragrances"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "fragrances" SET "description" = ?, "image_url" = ?, "updated_at" = ? WHERE "fragrances"."id" = ?  [["description", "and juice"], ["image_url", "snoops"], ["updated_at", "2024-07-30 03:10:51.259335"], ["id", 21]]

    def destroy
        Fragrance.find_by(id: params[:id]).destroy
---
DELETE FROM "fragrances" WHERE "fragrances"."id" = ?  [["id", 10]]
SELECT "fragrances".* FROM "fragrances" WHERE "fragrances"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]