app/controllers/fragrances_controller.rb

SELECT "fragrances".* FROM "fragrances" ORDER BY "fragrances"."name" ASC
---
    def index
        @fragrances = Fragrance.order(:name).all