app/controllers/orders_controller.rb

SELECT "fragrances"."name", "fragrances"."id" FROM "fragrances" ORDER BY "fragrances"."name" ASC
---
    def home
        @fragrance_list = Fragrance.order(:name).pluck(:name, :id).prepend(['', nil])

SELECT "fragrances"."name", "fragrances"."id" FROM "fragrances" ORDER BY "fragrances"."name" ASC
---
    def create_order
        service = OrderService.create_order(*build_order_param)
        @fragrance_list = Fragrance.order(:name).pluck(:name, :id).prepend(['', nil])