app/controllers/orders_controller.rb

    def before_action
        @fragrance_list = Fragrance.order(:name).pluck(:name, :id).prepend(['', nil])
---
SELECT "fragrances"."name", "fragrances"."id" FROM "fragrances" ORDER BY "fragrances"."name" ASC